adafruit/Adafruit_nRF52_Arduino/boards.txt
# Debug Menu
cluenrf52840.menu.debug.l0=Level 0 (Release)
cluenrf52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
cluenrf52840.menu.debug.l1=Level 1 (Error Message)
cluenrf52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
cluenrf52840.menu.debug.l2=Level 2 (Full Debug)
cluenrf52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
cluenrf52840.menu.debug.l3=Level 3 (Segger SystemView)
cluenrf52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
cluenrf52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Metro nRF52840 Express
# ----------------------------------
metro52840.name=Adafruit Metro nRF52840 Express

# VID/PID for bootloader with/without UF2, Arduino + Circuitpython App
metro52840.vid.0=0x239A
metro52840.pid.0=0x803F
metro52840.vid.1=0x239A
metro52840.pid.1=0x003F
metro52840.vid.2=0x239A
metro52840.pid.2=0x0040
metro52840.vid.3=0x239A
metro52840.pid.3=0x8040

# Upload
metro52840.bootloader.tool=bootburn
metro52840.upload.tool=nrfutil
metro52840.upload.protocol=nrfutil
metro52840.upload.use_1200bps_touch=true
metro52840.upload.wait_for_upload_port=true
metro52840.upload.maximum_size=815104
metro52840.upload.maximum_data_size=237568

# Build
metro52840.build.mcu=cortex-m4
metro52840.build.f_cpu=64000000
metro52840.build.board=NRF52840_METRO
metro52840.build.core=nRF5
metro52840.build.variant=metro_nrf52840_express
metro52840.build.usb_manufacturer="Adafruit LLC"
metro52840.build.usb_product="Metro nRF52840 Express"
metro52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
metro52840.build.ldscript=nrf52840_s140_v6.ld
metro52840.build.vid=0x239A
metro52840.build.pid=0x803F

# SofDevice Menu
metro52840.menu.softdevice.s140v6=S140 6.1.1
metro52840.menu.softdevice.s140v6.build.sd_name=s140
metro52840.menu.softdevice.s140v6.build.sd_version=6.1.1
metro52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
metro52840.menu.debug.l0=Level 0 (Release)
metro52840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
metro52840.menu.debug.l1=Level 1 (Error Message)
metro52840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
metro52840.menu.debug.l2=Level 2 (Full Debug)
metro52840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
metro52840.menu.debug.l3=Level 3 (Segger SystemView)
metro52840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
metro52840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1




# -------------------------------------------------------
# 
# Boards that aren't made by Adafruit
#
# -------------------------------------------------------

# ----------------------------------
# Opossum Pouch
# ----------------------------------
op1.name=Opossum Pouch nRF52833 (op1)
op1.bootloader.tool=bootburn

# Upload
op1.upload.tool=nrfutil
op1.upload.protocol=nrfutil
op1.upload.use_1200bps_touch=true
op1.upload.wait_for_upload_port=true
op1.upload.maximum_size=290816
op1.upload.maximum_data_size=52224

# Build
op1.build.mcu=cortex-m4
op1.build.f_cpu=64000000
op1.build.board=NRF52833_op1
op1.build.core=nRF5
op1.build.variant=opossum_pouch_nrf52833
op1.build.usb_manufacturer="Nordic"
op1.build.usb_product="nRF52833"
op1.build.extra_flags=-DNRF52833_XXAA {build.flags.usb}
op1.build.ldscript=nrf52833_s140_v6.ld
op1.build.vid=0x239A
op1.build.pid=0x8029

# SofDevice Menu
op1.menu.softdevice.s140v6=0.5.0 SoftDevice s140 6.1.1
op1.menu.softdevice.s140v6.build.sd_name=s140
op1.menu.softdevice.s140v6.build.sd_version=6.1.1
op1.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
op1.menu.debug.l0=Level 0 (Release)
op1.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
op1.menu.debug.l1=Level 1 (Error Message)
op1.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
op1.menu.debug.l2=Level 2 (Full Debug)
op1.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
op1.menu.debug.l3=Level 3 (Segger SystemView)
op1.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
op1.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1


# ----------------------------------
# Generic NRF52833
# ----------------------------------
generic_nrf52833.name=Generic nRF52833
generic_nrf52833.bootloader.tool=bootburn

# Upload
generic_nrf52833.upload.tool=nrfutil
generic_nrf52833.upload.protocol=nrfutil
generic_nrf52833.upload.use_1200bps_touch=true
generic_nrf52833.upload.wait_for_upload_port=true
generic_nrf52833.upload.maximum_size=290816
generic_nrf52833.upload.maximum_data_size=52224

# Build
generic_nrf52833.build.mcu=cortex-m4
generic_nrf52833.build.f_cpu=64000000
generic_nrf52833.build.board=GENERIC_NRF52833
generic_nrf52833.build.core=nRF5
generic_nrf52833.build.variant=generic_nrf52833
generic_nrf52833.build.usb_manufacturer="Generic"
generic_nrf52833.build.usb_product="generic-nRF52833"
generic_nrf52833.build.extra_flags=-DNRF52833_XXAA {build.flags.usb}
generic_nrf52833.build.ldscript=nrf52833_s140_v6.ld
generic_nrf52833.build.vid=0x1915
generic_nrf52833.build.pid=0x521F

# SofDevice Menu
generic_nrf52833.menu.softdevice.s140v6=0.5.0 SoftDevice s140 6.1.1
generic_nrf52833.menu.softdevice.s140v6.build.sd_name=s140
generic_nrf52833.menu.softdevice.s140v6.build.sd_version=6.1.1
generic_nrf52833.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Debug Menu
generic_nrf52833.menu.debug.l0=Level 0 (Release)
generic_nrf52833.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
generic_nrf52833.menu.debug.l1=Level 1 (Error Message)
generic_nrf52833.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
generic_nrf52833.menu.debug.l2=Level 2 (Full Debug)
generic_nrf52833.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
generic_nrf52833.menu.debug.l3=Level 3 (Segger SystemView)
generic_nrf52833.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
generic_nrf52833.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# ----------------------------------
# Nordic nRF52840DK (PCA10056)
# ----------------------------------
pca10056.name=Nordic nRF52840DK (PCA10056)
pca10056.bootloader.tool=bootburn

# Upload
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.vid=0x239A
pca10056.build.pid=0x8029

# SofDevice Menu
pca10056.menu.softdevice.s140v6=S140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

